bhxxwx/STM32F103CommLibrary/UserLib/Gen/GenLib.c
/*
 * Genlib.c
 *
 *  Created on: 2019年11月10日
 *      Author: WangXiang
 */
#include "Gen/GenLib.h"
#include "UserConfig.h"

char temp[usart_buffer_size] = { '\0' }; //串口输出暂存数组
uint16_t pwm_freq_B;
uint16_t pwm_freq_C;

uint8_t DB1, DB2, DB3, DB4, DC1, DC2, DC3, DC4;

typedef struct
{
	char RX_buffer[usart_buffer_size];
	uint16_t number;
	bool is_full;
} usart_cache; //串口缓冲区数据结构体

//初始化串口数据缓冲区
usart_cache Uart1_RX_Buffer;
usart_cache Uart2_RX_Buffer;

//static int uart1_in_cache = 0;
//static int uart2_in_cache = 0;

//检测是否已经初始化过相关功能
static bool adcinit_flag = false;
static bool pwminit_flag_B = false;
static bool pwminit_flag_C = false;

void (*function_handler)(void); //RTC定时秒中断中转函数指针
void (*systick_handler)(void); //中断中转函数指针

//各种初始化结构体
GPIO_InitTypeDef GPIO_InitStruct;
TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
TIM_OCInitTypeDef TIM_OCInitStructure;

/*
 * 中断优先级控制初始化
 * 只有抢占式优先级，没有响应优先级
 * 抢占优先级4位,可进行嵌套,可选值为:(高优先级)0~15(低优先级)
 * 使用串口2,3或中断的时候需要先初始化该函数
 */
void nvic_init()
{
	//只有抢占式优先级，没有响应优先级
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
}

/*
 * 串口1初始化
 * 优先级为1
 */
void usart_1_init(int bandrate)
{
	Uart1_RX_Buffer.is_full = false;
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
	USART_DeInit(USART1);
	nvic_init();

	//USART1_TX   PA.9
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	//USART1_RX	  PA.10
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	//Usart1 NVIC
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; //抢占优先级
	//NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;//响应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	//USART
	USART_InitStructure.USART_BaudRate = bandrate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl =
	USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	USART_Init(USART1, &USART_InitStructure);
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);	//打开接收到数据中断
	USART_Cmd(USART1, ENABLE);
}

/*
 * 串口2控制初始化
 * bandrate:波特率设置
 * nvic_pree:抢占优先级4位,可进行嵌套,可选值为:(高优先级)0~15(低优先级)
 */
void usart_2_init(int bandrate, char nvic_pree)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	USART_DeInit(USART2);

	//USART2_TX   PA.2
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	//USART2_RX	  PA.3
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	//Usart2 NVIC
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = nvic_pree;	//抢占优先级
	//NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;//响应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	//USART
	USART_InitStructure.USART_BaudRate = bandrate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl =
	USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	USART_Init(USART2, &USART_InitStructure);
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);	//打开接收到数据中断
	USART_Cmd(USART2, ENABLE);
}

/*
 * 串口3控制初始化
 * bandrate:波特率设置
 * nvic_pree:抢占优先级4位,可进行嵌套,可选值为:(高优先级)0~15(低优先级)
 */
void usart_3_init(int bandrate, char nvic_pree)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	USART_DeInit(USART3);

	//USART3_TX   PB.10
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	//USART3_RX	  PB.11
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	//Usart3 NVIC
	NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = nvic_pree;	//抢占优先级
	//NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;//响应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	//USART
	USART_InitStructure.USART_BaudRate = bandrate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl =
	USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	USART_Init(USART3, &USART_InitStructure);
	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);	//打开接收到数据中断
	USART_Cmd(USART3, ENABLE);
}

/*
 * 检测串口1数据缓冲区未读取数据个数
 * 返回值:	缓冲区数据个数(>=0)
 * 			-1->缓冲区以及溢出，存在数据丢失
 */
int check_usart1_cache()
{
	if (Uart1_RX_Buffer.is_full == true)
		return -1;
	else
		return Uart1_RX_Buffer.number;
}

/*
 * 检测串口2数据缓冲区未读取数据个数
 * 返回值:	缓冲区数据个数(>=0)
 * 			-1->缓冲区以及溢出，存在数据丢失
 */
int check_usart2_cache()
{
	if (Uart2_RX_Buffer.is_full == true)
		return -1;
	else
		return Uart2_RX_Buffer.number;
}

