bhxxwx/STM32F103CommLibrary/UserLib/Gen/GenLib.c
/*
 * 从串口1数据缓冲区读取全部数据,并清零缓冲区
 */
char *usart1_readToEnd()
{
	int i = 0;
	for (i = 0; i < Uart1_RX_Buffer.number; i++)	//将缓冲区数据复制到暂存数组
	{
		temp[i] = Uart1_RX_Buffer.RX_buffer[i];
	}
	for (; i < usart_buffer_size; i++)	//将暂存数组之后的数据清零
	{
		temp[i] = '\0';
	}
	Uart1_RX_Buffer.number = 0;	//清零数据位数,下一次数据接收放到缓冲区0位
	return temp;
}

/*
 * 从串口2数据缓冲区读取全部数据,并清零缓冲区
 */
char *usart2_readToEnd()
{
	int i = 0;
	for (i = 0; i < Uart2_RX_Buffer.number; i++)	//将缓冲区数据复制到暂存数组
	{
		temp[i] = Uart2_RX_Buffer.RX_buffer[i];
	}
	for (; i < usart_buffer_size; i++)	//将暂存数组之后的数据清零
	{
		temp[i] = '\0';
	}
	Uart2_RX_Buffer.number = 0;	//清零数据位数,下一次数据接收放到缓冲区0位
	return temp;
}

//void USART1_IRQHandler(void)
//{
//	if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)	//接收到数据
//	{
//		USART_ClearITPendingBit(USART1, USART_IT_RXNE); //清除接收中断标志
//
//		if (Uart1_RX_Buffer.number < usart_buffer_size) //如果当前数组小于缓冲区大小
//		{
//			Uart1_RX_Buffer.RX_buffer[Uart1_RX_Buffer.number] = USART_ReceiveData(USART1); //接收串口1数据到buff缓冲区
////			uart1_in_cache++;
//			Uart1_RX_Buffer.number++; //数据位数+1
//		} else
//		{
//			Uart1_RX_Buffer.is_full = true; //缓冲区已满
//		}
//	}
//}

void USART2_IRQHandler(void)
{
	if (USART_GetITStatus(USART2, USART_IT_RXNE) != RESET) //接收到数据
	{
		USART_ClearITPendingBit(USART2, USART_IT_RXNE); //清除接收中断标志
		if (Uart2_RX_Buffer.number < usart_buffer_size)
		{
			Uart2_RX_Buffer.RX_buffer[Uart2_RX_Buffer.number] = USART_ReceiveData(USART2); //接收串口1数据到buff缓冲区
//			uart2_in_cache++;
			Uart2_RX_Buffer.number++;
		} else
		{
			Uart2_RX_Buffer.is_full = true;
		}
	}
}

//void USART3_IRQHandler(void)
//{
//	if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET) //接收到数据
//	{
//		USART_ClearITPendingBit(USART3, USART_IT_RXNE); //清除接收中断标志
//		USART_ReceiveData(USART3);
//	}
//}

/*
 * 串口1发送数据
 * 参数:  data->需要发送的数据的char型指针
 * 		  length->发送的数据位数
 */
void usart_1_send(uint8_t *data, int length)
{
	int i = 0;
	for (; i < length; i++)
	{
		while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
			//等待当前数据发送完成
			;
		USART_SendData(USART1, *(data + i));
	}
}

/*
 * 串口2发送数据
 * 参数:  data->需要发送的数据的char型指针
 * 		  length->发送的数据位数
 */
void usart_2_send(uint8_t *data, int length)
{
	int i = 0;
	for (; i < length; i++)
	{
		while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET)
			//等待当前数据发送完成
			;
		USART_SendData(USART2, *(data + i));
	}
}

/*
 * 串口3发送数据
 * 参数:  data->需要发送的数据的char型指针
 * 		  length->发送的数据位数
 */
void usart_3_send(char *data)
{
	int i = 0;
	int length = strlen(data);
	for (; i < length; i++)
	{
		while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET)
			//等待当前数据发送完成
			;
		USART_SendData(USART3, *(data + i));
	}
}

/*
 * 设置CPU时钟为72MHz
 * 返回系统各时钟频率数值
 * 一般用不到
 */
RCC_ClocksTypeDef set_cpu_72MHz()
{
	RCC_ClocksTypeDef get_rcc_clock;
#if defined(STM32F10X_HD)||defined(STM32F10X_MD)
	//set the CPU clock as 72MHz
	RCC_HSEConfig(RCC_HSE_OFF);
	RCC_PLLConfig(RCC_PLLSource_HSE_Div1, RCC_PLLMul_9);
	RCC_HSEConfig(RCC_HSE_ON);
	RCC_PCLK1Config(RCC_HCLK_Div4);//APB1
	RCC_WaitForHSEStartUp();
	RCC_HCLKConfig(RCC_SYSCLK_Div1);
	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
#endif
	RCC_GetClocksFreq(&get_rcc_clock);
	return get_rcc_clock;
}

/* 定时器延迟,无中断,使用外部时钟信号
 * (精确)
 * 最高延时1.8s，即1864135us
 * 注意，使用操作系统时不能使用该函数
 */
void delay_tick_us(u32 time)
{
	u32 temp;
	SysTick->LOAD = 9 * time;
	SysTick->VAL = 0X00;   //清空计数器
	SysTick->CTRL = 0X01;   //使能，减到零是无动作，采用外部时钟源
	do
	{
		temp = SysTick->CTRL;   //读取当前倒计数值
	} while ((temp & 0x01) && (!(temp & (1 << 16)))); //等待时间到达
	SysTick->CTRL = 0x00; //关闭计数器
	SysTick->VAL = 0X00; //清空计数器
}

/* RTC计时器初始化
 * 设定优先级为1
 * 设定每一秒钟一次中断
 * 默认中断开启
 *
 * 使用 RTC_IT_ON; 开启RTC中断
 * 使用 RTC_IT_OFF; 关闭RTC中断
 */
void RTC_1s_it_init()
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = RTC_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; //抢占优先级
	//NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;//响应优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	PWR_BackupAccessCmd(ENABLE);
	RCC_RTCCLKConfig(RCC_RTCCLKSource_HSE_Div128);	//选择HSE_Div128时钟作为RTC时钟，此外还可以选择：LSI、LSE
	RCC_RTCCLKCmd(ENABLE);	//使能RTC时钟
	RTC_WaitForSynchro();
	RTC_WaitForLastTask();

	RTC_EnterConfigMode();	/// 允许配置
#if defined(STM32F10X_MD)||defined(STM32F10X_HD)
	RTC_SetPrescaler(62500);
#endif
#ifdef STM32F10X_CL
	RTC_SetPrescaler(195313);
#endif
	RTC_WaitForLastTask();
	RTC_ExitConfigMode(); //退出配置模式

	RTC_ClearITPendingBit(RTC_IT_SEC);
	RTC_WaitForSynchro();
	RTC_ITConfig(RTC_IT_SEC, ENABLE); //秒中断使能秒,用来产生一个可编程的周期性中断信号(最长可达1秒)。
	RTC_WaitForLastTask();

}

/* RTC中断函数传递函数
 * 参数:用户自定义函数的函数名(地址)
 * 例如:RTC_Handler(test_hander)
 */
void RTC_Handler(void (*temp_function))
{
	//RTC_ITConfig(RTC_IT_SEC, ENABLE); //秒中断使能秒,用来产生一个可编程的周期性中断信号(最长可达1秒)。
	function_handler = temp_function;
}

void RTC_IRQHandler(void) //RTC中断函数
{
	if (function_handler == 0x0)
	{
		RTC_ClearITPendingBit(RTC_IT_SEC); //清除中断标记
		return;
	}
	if (RTC_GetITStatus(RTC_IT_SEC) != RESET) //秒中断
	{
		function_handler();
		RTC_ClearITPendingBit(RTC_IT_SEC); //清除中断标记
	}
}

/* 软件延时,系统时钟为72MHz时使用,否则不精确
 * 相差1us
 * (精确)
 */
void delay_us(__IO u32 time)
{
	int i = 0;
	unsigned char temp = 4;
	for (i = time; i >= 0; i--)
	{
		while (temp)
		{
			//__NOP();//单周期指令 1/72M=0.01389us
			temp--;
		}
		temp = 4;
	}
}

/*
 * 系统计时器中断，最大中断延时233ms
 * 参数:
 * 		u32 time:最小值为43,
 * 			最大值为72000000	,
 * 			特殊取值下:
 * 				1000 -> 1ms中断一次
 * 				100000 -> 10us中断一次
 * 				1000000 -> 1us中断一次
 * 		(*temp_function):中断服务函数地址
 *
 * 示例:systick_delay(1000,TEST_FUN);
 *
 * 注意!如果报错,请将src/stm32f1xx_it.c中的SysTick_Handler(void)函数注释掉
 */
void systick_delay(u32 time, void (*temp_function))
{
	u32 temp = SystemCoreClock / 10;
	temp = SystemCoreClock / time;
	if (temp > 0xFFFFFF)
		temp = 0xFFFFFF;
	if (SysTick_Config(temp))
	{
		/* Capture error */
		while (1)
			;
	}
	systick_handler = temp_function;
//	SysTick->CTRL = 0x00;   //失能SysTick
//	SysTick->VAL = 0x00;    //当前值清零
}

