bhxxwx/STM32F103CommLibrary/UserLib/Gen/GenLib.c
/*
 * flash初始化
 * 擦除一页需22ms
 * page:初始化页地址
 */
void Flash_Erase(uint32_t page)
{
	FLASH_SetLatency(FLASH_Latency_2); //FLASH时序延迟几个周期，等待总线同步操作
	FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Enable); //开启FLASH预读缓冲功能，加速FLASH的读取
	FLASH_Unlock();
	FLASH_ClearFlag(FLASH_FLAG_BSY | FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
	FLASH_ErasePage(page);
	FLASH_Lock();
}

/*
 * 以16位写入方式8位buffer
 * page:写入页地址
 * buffer:需要写入的8位数据指针
 * length:需要写入数据的长度
 * 该函数返回最后一个写入数据的flash地址，或者返回第几位数据写入失败
 */
uint32_t FlashWrite_8bitbuffer(uint32_t page, uint8_t *buffer, uint32_t length)
{
	uint16_t i, data = 0;
	uint32_t lastaddr = 0;
	FLASH_Unlock();
	FLASH_ClearFlag(FLASH_FLAG_BSY | FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
	for (i = 0; i < length; i += 2)
	{
		data = (*(buffer + i + 1) << 8) + (*(buffer + i));
		if (FLASH_ProgramHalfWord((uint32_t) (page + i), data) != FLASH_COMPLETE)
		{
			return (uint32_t) i;
		}
		lastaddr = (uint32_t) (page + i);
	}
	FLASH_Lock();
	return (uint32_t) lastaddr;
}

/*
 * 以16位写入方式16位buffer
 * page:写入页地址
 * buffer:需要写入的16位数据指针
 * length:需要写入数据的长度
 * 该函数返回最后一个写入数据的flash地址，或者返回第几位数据写入失败
 */
uint32_t FlashWrite_16bitbuffer(uint32_t page, uint16_t *buffer, uint32_t length)
{
	uint16_t i, data = 0;
	uint32_t lastaddr = 0;
	FLASH_Unlock();
	FLASH_ClearFlag(FLASH_FLAG_BSY | FLASH_FLAG_EOP | FLASH_FLAG_PGERR | FLASH_FLAG_WRPRTERR);
	for (i = 0; i < length; i += 2)
	{
		data = *(buffer + i);
		if (FLASH_ProgramHalfWord((uint32_t) (page + i), data) != FLASH_COMPLETE)
		{
			return i;
		}
		lastaddr = (uint32_t) (page + i);
	}
	FLASH_Lock();
	return lastaddr;
}

/*
 * 连续8位读出数据
 * address:读取数据首地址
 * *buffer:读出数据存放的目标地址
 * length:需要读取数据个数
 * 返回当前数据地址
 */
uint32_t FlashRead_8bitbuffer(uint32_t address, uint8_t *buffer, uint32_t length)
{
	memcpy(buffer, (void *) address, length);
	return address + length - 1;
}

/*
 *	读出指定地址16位数据
 *	低地址在低位
 */
uint16_t FlashRead_16bitbuffer(uint32_t address)
{
	return *(__IO uint16_t*) address;
}

/*
 * 计时器初始化,最大计时1.8s,溢出没有任何提醒,注意使用场合,操作系统中不能使用
 * systick_on;//开始计时
 * systick_off;//停止计时
 */
void time_counter_init()
{
	SysTick->LOAD = 0xFFFFFF;
	SysTick->VAL = 0X00;   //清空计数器
	SysTick->CTRL = 0x00; //关闭计数器
}

/*
 * 返回计时值，单位us
 */
int time_counter_value()
{
	int finishtime = 0, time = 0;
	time = (SysTick->VAL);
	finishtime = (0xFFFFFF - time) / 9;
	return finishtime;
}

void adc_init()
{
	ADC_InitTypeDef ADC_InitStructure;
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE); //使能ADC1通道时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC2, ENABLE); //使能ADC2通道时钟
	RCC_ADCCLKConfig(RCC_PCLK2_Div6);   //设置ADC分频因子6,72M/6=12MHz,ADC最大不能超过14M
	ADC_DeInit(ADC1);  //复位ADC1,将外设 ADC1 的全部寄存器重设为缺省值
	ADC_DeInit(ADC2);  //复位ADC2,将外设 ADC2 的全部寄存器重设为缺省值
	ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;	//ADC工作模式:ADC1和ADC2工作在独立模式
	ADC_InitStructure.ADC_ScanConvMode = DISABLE;	//模数转换工作在单通道模式
	ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;	//模数转换工作在单次转换模式
	ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;	//转换由软件而不是外部触发启动
	ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;	//ADC数据右对齐
	ADC_InitStructure.ADC_NbrOfChannel = 1;	//顺序进行规则转换的ADC通道的数目
	ADC_Init(ADC1, &ADC_InitStructure);	//根据ADC_InitStruct中指定的参数初始化外设ADCx的寄存器
	ADC_Init(ADC2, &ADC_InitStructure);	//根据ADC_InitStruct中指定的参数初始化外设ADCx的寄存器

	ADC_Cmd(ADC1, ENABLE);	//使能指定的ADC1
	ADC_ResetCalibration(ADC1);	//使能复位校准
	while (ADC_GetResetCalibrationStatus(ADC1))
		;	//等待复位校准结束
	ADC_StartCalibration(ADC1);	 //开启AD校准
	while (ADC_GetCalibrationStatus(ADC1))
		;	 //等待校准结束

	ADC_Cmd(ADC2, ENABLE);	//使能指定的ADC2
	ADC_ResetCalibration(ADC2);	//使能复位校准
	while (ADC_GetResetCalibrationStatus(ADC2))
		;	//等待复位校准结束
	ADC_StartCalibration(ADC2);	 //开启AD校准
	while (ADC_GetCalibrationStatus(ADC2))
		;	 //等待校准结束
	adcinit_flag = true;
}


void pinMode(uint8_t Px, uint16_t GPIO_Pin, GPIOMode_TypeDef GPIO_Mode)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	GPIOA;
}

/*
 * GPIOA引脚模式设置
 * GPIO_Pin_:GPIO_Pin_X
 * GPIO_Mode: OUTPUT 推挽输出
 *			  INPUT 浮空输入
 *			  AIN 模拟输入(ADC)
 *			  IPU 上拉输入
 *			  IPD 下拉输入
 *			  AOT 模拟输出(DAC)
 */
void pinModeA(uint16_t GPIO_Pin, GPIOMode_TypeDef GPIO_Mode)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	if (GPIO_Mode == GPIO_Mode_AIN)
	{
		if (adcinit_flag == false)
		{
			adc_init();
			/***************************************DAC******************************************************/
			DAC_InitTypeDef DAC_InitType;
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);	  //使能DAC通道时钟
			DAC_InitType.DAC_Trigger = DAC_Trigger_None;	//不使用触发功能 TEN1=0
			DAC_InitType.DAC_WaveGeneration = DAC_WaveGeneration_None;	//不使用波形发生
			DAC_InitType.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bit0;	//屏蔽、幅值设置
			DAC_InitType.DAC_OutputBuffer = DAC_OutputBuffer_Disable;	//DAC1输出缓存关闭 BOFF1=1
			DAC_Init(DAC_Channel_1, &DAC_InitType);	 //初始化DAC通道1
			DAC_Init(DAC_Channel_2, &DAC_InitType);	 //初始化DAC通道2

			DAC_Cmd(DAC_Channel_1, ENABLE);  //使能DAC通道1
			DAC_Cmd(DAC_Channel_2, ENABLE);  //使能DAC通道2

			DAC_SetChannel1Data(DAC_Align_12b_R, 0);  //12位右对齐数据格式设置DAC值
			DAC_SetChannel2Data(DAC_Align_12b_R, 0);  //12位右对齐数据格式设置DAC值
		}
	}
}

/*
 * GPIOB引脚模式设置
 * GPIO_Pin_:GPIO_Pin_X
 * GPIO_Mode: OUTPUT 推挽输出
 *			  INPUT 浮空输入
 *			  IPU 上拉输入
 *			  IPD 下拉输入
 *			  PWM PWM输出,默认频率10kHz
 */
void pinModeB(uint16_t GPIO_Pin, GPIOMode_TypeDef GPIO_Mode)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStruct);
	if (GPIO_Mode == GPIO_Mode_AF_PP)
	{
		if (pwminit_flag_B == false)
		{
			RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

			//设置在下一个更新事件装入活动的自动重装载寄存器周期的值
			//PWM频率:72000/(899+1)=80khz
			TIM_TimeBaseStructure.TIM_Period = PWM_Freq_B;
			pwm_freq_B = PWM_Freq_B;

			TIM_TimeBaseStructure.TIM_Prescaler = 0; //设置用来作为TIMx时钟频率除数的预分频值
			TIM_TimeBaseStructure.TIM_ClockDivision = 0; //设置时钟分割:TDTS = Tck_tim
			TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  //TIM向上计数模式
			TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure); //根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位

			TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2; //选择定时器模式:TIM脉冲宽度调制模式2
			TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //比较输出使能
			TIM_OCInitStructure.TIM_Pulse = 0; //设置待装入捕获比较寄存器的脉冲值
			TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; //输出极性:TIM输出比较极性高
			TIM_OC1Init(TIM4, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx
			TIM_OC2Init(TIM4, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx

