bhxxwx/STM32F103CommLibrary/UserLib/Gen/GenLib.c
#ifdef PWM_Complementary_B
			TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //输出极性:TIM输出比较极性高
#endif
			TIM_OC3Init(TIM4, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx
			TIM_OC4Init(TIM4, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx

			TIM_CtrlPWMOutputs(TIM4, ENABLE);	//MOE 主输出使能

			TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);  //CH1预装载使能
			TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);  //CH2预装载使能
			TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);  //CH3预装载使能
			TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);  //CH4预装载使能

			TIM_ARRPreloadConfig(TIM4, ENABLE); //使能TIMx在ARR上的预装载寄存器

			TIM_Cmd(TIM4, ENABLE);  //使能TIM1
			pwminit_flag_B = true;
		}
	}
}

/*
 * GPIOC引脚模式设置
 * GPIO_Pin_:GPIO_Pin_X
 * GPIO_Mode: OUTPUT 推挽输出
 *			  INPUT 浮空输入
 *			  AIN 模拟输入
 *			  IPU 上拉输入
 *			  IPD 下拉输入
 *			  PWM PWM输出,默认频率100kHz
 */
void pinModeC(uint16_t GPIO_Pin, GPIOMode_TypeDef GPIO_Mode)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStruct);
	if (GPIO_Mode == GPIO_Mode_AIN)
	{
		if (adcinit_flag == false)
		{
			adc_init();
		}
	}
	if (GPIO_Mode == GPIO_Mode_AF_PP)
	{
		if (pwminit_flag_C == false)
		{
			RCC_APB2PeriphClockCmd(RCC_APB2Periph_TIM8, ENABLE);

			//设置在下一个更新事件装入活动的自动重装载寄存器周期的值
			//PWM频率:72000/(899+1)=80khz
			TIM_TimeBaseStructure.TIM_Period = PWM_Freq_C;
			pwm_freq_C = PWM_Freq_C;

			TIM_TimeBaseStructure.TIM_Prescaler = 0; //设置用来作为TIMx时钟频率除数的预分频值
			TIM_TimeBaseStructure.TIM_ClockDivision = 0; //设置时钟分割:TDTS = Tck_tim
			TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  //TIM向上计数模式
			TIM_TimeBaseInit(TIM8, &TIM_TimeBaseStructure); //根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位

			TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2; //选择定时器模式:TIM脉冲宽度调制模式2
			TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; //比较输出使能
			TIM_OCInitStructure.TIM_Pulse = 0; //设置待装入捕获比较寄存器的脉冲值
			TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low; //输出极性:TIM输出比较极性高
			TIM_OC1Init(TIM8, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx
			TIM_OC2Init(TIM8, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx
#ifdef PWM_Complementary_C
			        TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High; //输出极性:TIM输出比较极性高
#endif
			TIM_OC3Init(TIM8, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx
			TIM_OC4Init(TIM8, &TIM_OCInitStructure);  //根据TIM_OCInitStruct中指定的参数初始化外设TIMx

			TIM_CtrlPWMOutputs(TIM8, ENABLE);	//MOE 主输出使能

			TIM_OC1PreloadConfig(TIM8, TIM_OCPreload_Enable);  //CH1预装载使能
			TIM_OC2PreloadConfig(TIM8, TIM_OCPreload_Enable);  //CH2预装载使能
			TIM_OC3PreloadConfig(TIM8, TIM_OCPreload_Enable);  //CH3预装载使能
			TIM_OC4PreloadConfig(TIM8, TIM_OCPreload_Enable);  //CH4预装载使能

			TIM_ARRPreloadConfig(TIM8, ENABLE); //使能TIMx在ARR上的预装载寄存器

			TIM_Cmd(TIM8, ENABLE);  //使能TIM1
			pwminit_flag_C = true;
		}
	}
}

/*
 * GPIOD引脚模式设置
 * GPIO_Pin_:GPIO_Pin_X
 * GPIO_Mode: OUTPUT 推挽输出
 *			  INPUT  浮空输入
 *			  IPU    上拉输入
 *			  IPD    下拉输入
 */
void pinModeD(uint16_t GPIO_Pin, GPIOMode_TypeDef GPIO_Mode)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOD, &GPIO_InitStruct);
}

/*
 * 读取GPIOA端口 Pin_0 ~ Pin_7的模拟输入
 * 使用前请将A端口模式置为模拟输入模式，例:
 * 		pinModeA(GPIO_Pin_7,AIN);
 */
uint16_t analogeReadA(uint16_t GPIO_Pin)
{
	uint8_t ch = 0;
	switch (GPIO_Pin)
	{
		case GPIO_Pin_0:
			ch = 0;
			break;
		case GPIO_Pin_1:
			ch = 1;
			break;
		case GPIO_Pin_2:
			ch = 2;
			break;
		case GPIO_Pin_3:
			ch = 3;
			break;
		case GPIO_Pin_4:
			ch = 4;
			break;
		case GPIO_Pin_5:
			ch = 5;
			break;
		case GPIO_Pin_6:
			ch = 6;
			break;
		case GPIO_Pin_7:
			ch = 7;
			break;
		default:
			ch = 17;
	}
	//设置指定ADC的规则组通道，一个序列，采样时间
	ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_239Cycles5);	//ADC1,ADC通道,采样时间为239.5周期

	ADC_SoftwareStartConvCmd(ADC1, ENABLE);	//使能指定的ADC1的软件转换启动功能

	while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC))
		;		//等待转换结束

	return ADC_GetConversionValue(ADC1);	//返回最近一次ADC1规则组的转换结果
}

/*
 * 读取GPIOC端口 Pin_0 ~ Pin_5的模拟输入
 * 使用前请将C端口模式置为模拟输入模式，例:
 * 		pinModeC(GPIO_Pin_7,AIN);
 */
uint16_t analogeReadC(uint16_t GPIO_Pin)
{
	uint8_t ch = 0;
	switch (GPIO_Pin)
	{
		case GPIO_Pin_0:
			ch = 10;
			break;
		case GPIO_Pin_1:
			ch = 11;
			break;
		case GPIO_Pin_2:
			ch = 12;
			break;
		case GPIO_Pin_3:
			ch = 13;
			break;
		case GPIO_Pin_4:
			ch = 14;
			break;
		case GPIO_Pin_5:
			ch = 15;
			break;
		default:
			ch = 17;
	}
	//设置指定ADC的规则组通道，一个序列，采样时间
	ADC_RegularChannelConfig(ADC2, ch, 1, ADC_SampleTime_239Cycles5);	//ADC2,ADC通道,采样时间为239.5周期

	ADC_SoftwareStartConvCmd(ADC2, ENABLE);	//使能指定的ADC2的软件转换启动功能

	while (!ADC_GetFlagStatus(ADC2, ADC_FLAG_EOC))
		;		//等待转换结束

	return ADC_GetConversionValue(ADC2);	//返回最近一次ADC2规则组的转换结果
}

/*
 * DAC模拟输出
 * 		GPIO_Pin  引脚控制,值为GPIO_Pin_4或5
 * 		value	输出电压控制(0~3.3),值为0~4095
 */
void analogWrite(uint16_t GPIO_Pin, uint16_t value)
{
	if (GPIO_Pin == GPIO_Pin_4)
		DAC_SetChannel1Data(DAC_Align_12b_R, value);  //12位右对齐数据格式设置DAC值
	if (GPIO_Pin == GPIO_Pin_5)
		DAC_SetChannel2Data(DAC_Align_12b_R, value);  //12位右对齐数据格式设置DAC值
}

/*
 * GPIOB口的PWM占空比调节函数
 * 如果开启PWM_Complementary则没办法设置PB8和PB9的占空比,此时PB8和PB9的占空比分别由PB6和PB7决定
 * 参数:
 * 		GPIO_Pin 调节的PB端口引脚
 * 		Duty 调节的占空比值(0~100)
 */
void DutyCycleB(uint16_t GPIO_Pin, uint8_t Duty)
{
	int16_t dutycycle = pwm_freq_B * Duty * 0.01;

	if (GPIO_Pin == GPIO_Pin_6)
	{
		DB1 = Duty;
		TIM_SetCompare1(TIM4, dutycycle);
#ifdef PWM_Complementary_B
		DB3=Duty;
		TIM_SetCompare3(TIM4, dutycycle);
#endif
	}
	if (GPIO_Pin == GPIO_Pin_7)
	{
		DB2 = Duty;
		TIM_SetCompare2(TIM4, dutycycle);
#ifdef PWM_Complementary_B
		DB4=Duty;
		TIM_SetCompare4(TIM4, dutycycle);
#endif
	}
#ifndef PWM_Complementary_B
	if (GPIO_Pin == GPIO_Pin_8)
	{
		DB3 = Duty;
		TIM_SetCompare3(TIM4, dutycycle);
	}
	if (GPIO_Pin == GPIO_Pin_9)
	{
		DB4 = Duty;
		TIM_SetCompare4(TIM4, dutycycle);
	}
#endif

