bhxxwx/STM32F103CommLibrary/UserLib/Gen/GenLib.c
}

/*
 * GPIOC口的PWM占空比调节函数
 * 参数:
 * 		GPIO_Pin 调节的PB端口引脚
 * 		Duty 调节的占空比值(0~100)
 */
void DutyCycleC(uint16_t GPIO_Pin, uint8_t Duty)
{
	int16_t dutycycle = pwm_freq_C * Duty * 0.01;

	if (GPIO_Pin == GPIO_Pin_6)
	{
		DC1 = Duty;
		TIM_SetCompare1(TIM8, dutycycle);
#ifdef PWM_Complementary_C
		DC3=Duty;
		TIM_SetCompare3(TIM8, dutycycle);
#endif
	}
	if (GPIO_Pin == GPIO_Pin_7)
	{
		DC2 = Duty;
		TIM_SetCompare2(TIM8, dutycycle);
#ifdef PWM_Complementary_C
		DC4=Duty;
		TIM_SetCompare4(TIM8, dutycycle);
#endif
	}
#ifndef PWM_Complementary_C
	if (GPIO_Pin == GPIO_Pin_8)
	{
		DC3 = Duty;
		TIM_SetCompare3(TIM8, dutycycle);
	}
	if (GPIO_Pin == GPIO_Pin_9)
	{
		DC4 = Duty;
		TIM_SetCompare4(TIM8, dutycycle);
	}
#endif
}

/*
 *  设置PWM频率
 *  参数:
 *  	GPIOx 值为GPIOB或者GPIOC,设置PB口或者PC口PWM的频率
 *  	freq 输入PWM频率,范围:1010~72000000Hz
 */
void SetPWMfreq(GPIO_TypeDef* GPIOx, int freq)
{
	uint16_t arr = 72000000 / (freq) + 1;
	if (arr > 65535)
		arr = 65535;
	if (GPIOx == GPIOB)
	{
		TIM_TimeBaseStructure.TIM_Period = arr;
		pwm_freq_B = arr;
		TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure); //根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
		TIM_SetCompare1(TIM4, pwm_freq_B * DB1 * 0.01);
		TIM_SetCompare2(TIM4, pwm_freq_B * DB2 * 0.01);
		TIM_SetCompare3(TIM4, pwm_freq_B * DB3 * 0.01);
		TIM_SetCompare4(TIM4, pwm_freq_B * DB4 * 0.01);
	}
	if (GPIOx == GPIOC)
	{
		TIM_TimeBaseStructure.TIM_Period = arr;
		pwm_freq_C = arr;
		TIM_TimeBaseInit(TIM8, &TIM_TimeBaseStructure); //根据TIM_TimeBaseInitStruct中指定的参数初始化TIMx的时间基数单位
		TIM_SetCompare1(TIM8, pwm_freq_C * DC1 * 0.01);
		TIM_SetCompare2(TIM8, pwm_freq_C * DC2 * 0.01);
		TIM_SetCompare3(TIM8, pwm_freq_C * DC3 * 0.01);
		TIM_SetCompare4(TIM8, pwm_freq_C * DC4 * 0.01);
	}
}

#ifdef STM32F10X_HD
/*
 * 计时器中断!!!不准，还没有测试
 * 时钟频率为2kHz,最小时基为0.5ms,最大计时时间为32s
 * 参数:
 * 		times 计时时间,范围(1~32000)单位:毫秒
 * 	中断函数在BSP_Tim.c文件中
 */
void TIM7_init(uint16_t times)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = TIM7_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1; //配置抢断优先级
	NVIC_Init(&NVIC_InitStructure);//设置存入寄存器

	if (times <= 0)
	times = 1000;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	//预分频系数为36000-1,这样计数器时钟为72MHz/36000 = 2kHz,分辨率为0.5ms
	TIM_TimeBaseStructure.TIM_Prescaler = 36000 - 1;
	//设置时钟分割 TIM_CKD_DIV1=0x0000,不分割
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	//设置计数器模式为向上计数模式
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	//设置计数溢出大小，每计2000个数就产生一个更新事件
	TIM_TimeBaseStructure.TIM_Period = times * 2 - 1;
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;//将配置应用到TIM7中
	TIM_TimeBaseInit(TIM7, &TIM_TimeBaseStructure);
	TIM_UpdateRequestConfig( TIM7, TIM_UpdateSource_Regular);//使能计数器
	TIM_Cmd(TIM7, ENABLE);//使能中断
	TIM_ITConfig(TIM7, TIM_IT_Update, ENABLE);//清除标志位
	TIM_ClearFlag(TIM7, TIM_FLAG_Update);
}
#endif

/***************************************************CAN总线相关操作*******************************************************/
/*
 * CAN总线基本设置<弃用!CAN外设初始化内容移至各函数中>
 * 引脚,中断,时钟设置
 */
//void CAN_INIT()
//{
//#if defined(STM32F10X_HD)||defined(STM32F10X_MD)
//	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,
//			ENABLE);
//	RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
//	GPIO_InitTypeDef GPIO_InitStructure;
//
//	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//
//#ifdef USE_CAN_PB
//	//重映射到PB端口
//	/* Configure CAN pin: RX */
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
//	GPIO_Init(GPIOB, &GPIO_InitStructure);
//
//	/* Configure CAN pin: TX */
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//	GPIO_Init(GPIOB, &GPIO_InitStructure);
//
//	GPIO_PinRemapConfig(GPIO_Remap1_CAN1, ENABLE);	   //重影射CAN IO脚到 PB8,PB9
//#endif
//
//#ifdef USE_CAN_PA
//	//不重新映射,PA端口
//	/* Configure CAN pin: RX */
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
//	GPIO_Init(GPIOA, &GPIO_InitStructure);
//
//	/* Configure CAN pin: TX */
//	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
//	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//	GPIO_Init(GPIOA, &GPIO_InitStructure);
//#endif
//
//	NVIC_InitTypeDef NVIC_InitStructure;
//	/* Configure the NVIC Preemption Priority Bits */
//	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
//	/* VECT_TAB_FLASH  */
//	/* Set the Vector Table base location at 0x08000000 */
//	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);
//	/* enabling interrupt */
//	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
//	;
//	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
////	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
//	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
//	NVIC_Init(&NVIC_InitStructure);
//#endif
//}

/*
 * CAN总线基本设置(轮询模式,不使用中断)
 * 设置总线模式,总线频率(目前250kHz),过滤器
 */
void CAN_POLLING_INIT()
{
	CAN_InitTypeDef CAN_InitStructure;
	CAN_FilterInitTypeDef CAN_FilterInitStructure;
	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,
	        ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

#ifdef USE_CAN_PB
	//重映射到PB端口
	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_PinRemapConfig(GPIO_Remap1_CAN1, ENABLE);	   //重影射CAN IO脚到 PB8,PB9
#endif

#ifdef USE_CAN_PA
	//不重新映射,PA端口
	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif

	CAN_DeInit(CAN1);
//	CAN_OperatingModeRequest(CAN1, CAN_OperatingMode_Initialization);
	/* CAN register init */
	CAN_StructInit(&CAN_InitStructure);

	/* CAN cell init */
	CAN_InitStructure.CAN_TTCM = DISABLE;
	CAN_InitStructure.CAN_ABOM = DISABLE;
	CAN_InitStructure.CAN_AWUM = DISABLE;
	CAN_InitStructure.CAN_NART = DISABLE;
	CAN_InitStructure.CAN_RFLM = DISABLE;
	CAN_InitStructure.CAN_TXFP = DISABLE;
	CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
	CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStructure.CAN_BS1 = CAN_BS1_8tq;
	CAN_InitStructure.CAN_BS2 = CAN_BS2_3tq;
	CAN_InitStructure.CAN_Prescaler = 12;	   //  36M/(1+8+3)/12=250k
	CAN_Init(CAN1, &CAN_InitStructure);
	/* CAN filter init */
	CAN_FilterInitStructure.CAN_FilterNumber = 1;
	CAN_FilterInitStructure.CAN_FilterActivation = DISABLE;
	CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

