bhxxwx/STM32F103CommLibrary/UserLib/Gen/GenLib.c
}

/*
 * 轮询模式消息发送
 */
void CAN_POLLING_SEND(CanTxMsg TxMessage)
{
	uint8_t TransmitMailbox = 0;
	TransmitMailbox = CAN_Transmit(CAN1, &TxMessage);
	int i = 0;
	while ((CAN_TransmitStatus(CAN1, TransmitMailbox) != CANTXOK) && (i != 0xFF))
	{
		i++;
	}
}

/*
 * 轮询模式消息接收
 * 返回CanRxMsg类型数据
 */
CanRxMsg CAN_POLLING_REC()
{
	int i = 0;
	CanRxMsg RxMessage;
	while ((CAN_MessagePending(CAN1, CAN_FIFO0) < 1) && (i != 0xFF))
	{
		i++;
	}
	/* receive */
	if (CAN_MessagePending(CAN1, CAN_FIFO0) > 0)
	{

		CAN_Receive(CAN1, CAN_FIFO0, &RxMessage);
	}
	return RxMessage;
}

/*
 * CAN总线中断方式初始化
 * 设置总线模式,总线频率(目前250kHz)
 */
void CAN_IT_INIT()
{
	CAN_InitTypeDef CAN_InitStructure;
	CAN_FilterInitTypeDef CAN_FilterInitStructure;

	RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,
	        ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
	GPIO_InitTypeDef GPIO_InitStructure;

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

#ifdef USE_CAN_PB
	//重映射到PB端口
	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_PinRemapConfig(GPIO_Remap1_CAN1, ENABLE);	   //重影射CAN IO脚到 PB8,PB9
#endif

#ifdef USE_CAN_PA
	//不重新映射,PA端口
	/* Configure CAN pin: RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Configure CAN pin: TX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif

	NVIC_InitTypeDef NVIC_InitStructure;
	/* Configure the NVIC Preemption Priority Bits */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);
	/* VECT_TAB_FLASH  */
	/* Set the Vector Table base location at 0x08000000 */
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0);
	/* enabling interrupt */
#if defined(STM32F10X_HD) || defined(STM32F10X_MD) || defined(STM32F10X_LD)
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
#endif
#if defined(STM32F10X_CL)
	NVIC_InitStructure.NVIC_IRQChannel = CAN1_RX0_IRQn;
#endif
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
//	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* CAN register init */
	CAN_DeInit(CAN1);
	CAN_StructInit(&CAN_InitStructure);

	/* CAN cell init */
	CAN_InitStructure.CAN_TTCM = DISABLE;
	CAN_InitStructure.CAN_ABOM = DISABLE;
	CAN_InitStructure.CAN_AWUM = DISABLE;
	CAN_InitStructure.CAN_NART = DISABLE;
	CAN_InitStructure.CAN_RFLM = DISABLE;
	CAN_InitStructure.CAN_TXFP = DISABLE;
	CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
	CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;	   //1
	CAN_InitStructure.CAN_BS1 = CAN_BS1_8tq;	   //3
	CAN_InitStructure.CAN_BS2 = CAN_BS2_3tq;	   //2
	CAN_InitStructure.CAN_Prescaler = 12;   //  36M/(1+8+3)/12=250k//24
	CAN_Init(CAN1, &CAN_InitStructure);

	/* CAN filter init */
#ifdef defaultFIFO
	CAN_FilterInitStructure.CAN_FilterNumber = 1;
	CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	/* CAN FIFO0 message pending interrupt enable */
	CAN_ITConfig(CAN1, CAN_IT_FMP0, ENABLE);
#endif

#ifdef userDEFfilter
	CAN_FilterInitStructure.CAN_FilterNumber = 0;
	CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x18FF;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2111 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF8;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 1;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x18FF;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2313 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF8;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 2;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x18FF;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2413 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF8;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 3;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2715 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF8;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 4;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2815 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF8;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 5;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2915 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF8;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 6;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2515 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF0;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);

	CAN_FilterInitStructure.CAN_FilterNumber = 7;
	CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterIdLow = (0x2615 << 3) & 0xFFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0xFFF0;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = CAN_FIFO0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);
	CAN_ITConfig(CAN1, CAN_IT_FMP0, ENABLE);

#endif
}
/*
 * 中断模式数据发送
 */
void CAN_IT_SEND(CanTxMsg TxMessage)
{
	CAN_Transmit(CAN1, &TxMessage);
}

//CanRxMsg CAN_IT_REC();
/*
 * CAN/USB总线接收中断
 */
#if defined(STM32F10X_HD) || defined(STM32F10X_MD) || defined(STM32F10X_LD)
void USB_LP_CAN1_RX0_IRQHandler(void)
{
	CanRxMsg RxMessage;
	CAN_Receive(CAN1, CAN_FIFO0, &RxMessage);

	USB_Istr();

}
#endif
#if defined(STM32F10X_CL)
void CAN1_RX0_IRQHandler()
{
	static bool LED_FLAG = true;
	CanRxMsg RxMessage;
	digitalWriteA(GPIO_Pin_4, LED_FLAG);
	CAN_Receive(CAN1, CAN_FIFO0, &RxMessage);
	Analysis(RxMessage);
	LED_FLAG = !LED_FLAG;
//	USB_printf("%x",RxMessage.ExtId);
}
#endif

/*
 * 看门狗初始化,并且使能
 * 参数:
 * 		Div:分频系数选择,可为以下值:
 *     	@arg IWDG_Prescaler_4: IWDG prescaler set to 4
 *     	@arg IWDG_Prescaler_8: IWDG prescaler set to 8
 *     	@arg IWDG_Prescaler_16: IWDG prescaler set to 16
 *     	@arg IWDG_Prescaler_32: IWDG prescaler set to 32
 *     	@arg IWDG_Prescaler_64: IWDG prescaler set to 64
 *     	@arg IWDG_Prescaler_128: IWDG prescaler set to 128
 *     	@arg IWDG_Prescaler_256: IWDG prescaler set to 256
 *
 *      No:计数数值
 *
 *      看门狗时钟频率为40kHz,最终计时时间为(1/40000)*Div*No (s)
 *      例如64分频,重装载值为625,那么看门狗计时为1秒钟
 *
 */
void IWDG_INIT(uint8_t Div, u16 No)
{
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);  //使能对寄存器IWDG_PR和IWDG_RLR的写操作

	IWDG_SetPrescaler(Div);  //设置IWDG预分频值

	IWDG_SetReload(No);  //设置IWDG重装载值

	IWDG_ReloadCounter();  //按照IWDG重装载寄存器的值重装载IWDG计数器

	IWDG_Enable();  //使能IWDG
}

/*喂狗*/
void IWDG_Feed(void)
{
	IWDG_ReloadCounter();
}
